app/views/admins/show.html.erb

  <strong>Password:</strong>
  <% adm = Admin.find(params[:id])%>
---
SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT 1  [["id", 1]]