app/controllers/admins_controller.rb

INSERT INTO "admins" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "admin"], ["email", "admin@Admin.com"], ["password", "admin123"], ["created_at", "2015-10-03 23:55:01.853206"], ["updated_at", "2015-10-03 23:55:01.853206"]]
---
  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save

UPDATE "admins" SET "password" = $1, "updated_at" = $2 WHERE "admins"."id" = $3  [["password", "admin123"], ["updated_at", "2015-10-03 23:58:01.259126"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @admin.update(admin_params)

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_admin
      @admin = Admin.find(params[:id])