app/controllers/books_controller.rb

  def return
    @book.update(status: "Available")
---
UPDATE "books" SET "status" = $1, "updated_at" = $2 WHERE "books"."isbn" = $3  [["status", "Available"], ["updated_at", "2015-09-25 23:06:19.845157"], ["isbn", 1111]]