app/controllers/book_transactions_controller.rb

SELECT "book_transactions".* FROM "book_transactions"
---
  def index
    @book_transactions = BookTransaction.all

SELECT  "books".* FROM "books" WHERE "books"."isbn" = $1 LIMIT 1  [["isbn", 3464]]
INSERT INTO "book_transactions" ("book_id", "member_id") VALUES ($1, $2) RETURNING "id"  [["book_id", 3464], ["member_id", 1]]
UPDATE "books" SET "status" = $1, "updated_at" = $2 WHERE "books"."isbn" = $3  [["status", "Available"], ["updated_at", "2015-09-25 22:47:41.165598"], ["isbn", 3464]]
---
  def create2
    @book_transaction = BookTransaction.new(book_transaction_params)
    if member.books.where(isbn:book.isbn).count.odd?
     respond_to do |format|
        if @book_transaction.save
         @book_transaction.book.update(status: "Available")

SELECT  "books".* FROM "books" WHERE "books"."isbn" = $1 LIMIT 1  [["isbn", 12312312]]
SELECT COUNT(*) FROM "books" INNER JOIN "book_transactions" ON "books"."isbn" = "book_transactions"."book_id" WHERE "book_transactions"."member_id" = $1 AND "books"."isbn" = $2  [["member_id", 1], ["isbn", 1231111]]
INSERT INTO "book_transactions" ("book_id", "member_id") VALUES ($1, $2) RETURNING "id"  [["book_id", 12312312], ["member_id", 1]]
UPDATE "books" SET "status" = $1, "updated_at" = $2 WHERE "books"."isbn" = $3  [["status", "Checkout"], ["updated_at", "2015-09-25 20:47:14.709503"], ["isbn", 11111]]
---
  def create
    @book_transaction = BookTransaction.new(book_transaction_params)

    member = @book_transaction.member
    book = @book_transaction.book
    if member.books.where(isbn:book.isbn).count.even?
        respond_to do |format|
          if @book_transaction.save
           @book_transaction.book.update(status: "Checkout")

SELECT  "book_transactions".* FROM "book_transactions" WHERE "book_transactions"."id" = $1 LIMIT 1  [["id", 14]]
---
    def set_book_transaction
      @book_transaction = BookTransaction.find(params[:id])