app/controllers/books_controller.rb

SELECT "books".* FROM "books" WHERE (authors ILIKE '%cormen%')
---
  def index
    @books = Book.all

INSERT INTO "books" ("isbn", "name", "authors", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "isbn"  [["isbn", 123123], ["name", "rails"], ["authors", "haggu"], ["created_at", "2015-09-25 19:22:05.939089"], ["updated_at", "2015-09-25 19:22:05.939089"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

SELECT  "books".* FROM "books" WHERE "books"."isbn" = $1 LIMIT 1  [["isbn", 1233214]]
---
    def set_book
      @book = Book.find(params[:isbn])