app/controllers/members_controller.rb

SELECT "members".* FROM "members"
---
  def index
    @members = Member.all

INSERT INTO "members" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Kunal"], ["email", "kunal@kunal.com"], ["password", "kunal123"], ["created_at", "2015-09-25 20:26:06.740367"], ["updated_at", "2015-09-25 20:26:06.740367"]]
---
  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save

UPDATE "members" SET "name" = $1, "password" = $2, "updated_at" = $3 WHERE "members"."id" = $4  [["name", "Rahul Shah Sr."], ["password", "Rahul123123"], ["updated_at", "2015-10-03 23:20:35.822300"], ["id", 6]]
---
  def update
    respond_to do |format|
      if @member.update(member_params)

SELECT  "members".* FROM "members" WHERE "members"."id" = $1 LIMIT 1  [["id", 6]]
---
    def set_member
      @member = Member.find(params[:id])