app/controllers/sessions_controller.rb

SELECT  "admins".* FROM "admins" WHERE "admins"."email" = ? LIMIT 1  [["email", "rshah5@ncsu.edu"]]
SELECT  "members".* FROM "members" WHERE "members"."email" = ? LIMIT 1  [["email", "rshah5@ncsu.edu"]]
---
  def create
    user = nil
    admin = Admin.find_by(email: params[:session][:email].downcase)
    member = Member.find_by(email: params[:session][:email].downcase)