app/views/members/show.html.erb

SELECT "books".* FROM "books" INNER JOIN "book_transactions" ON "books"."isbn" = "book_transactions"."book_id" WHERE "book_transactions"."member_id" = $1  [["member_id", 1]]
SELECT "books"."isbn" FROM "books" INNER JOIN "book_transactions" ON "books"."isbn" = "book_transactions"."book_id" WHERE "book_transactions"."member_id" = $1  [["member_id", 1]]
SELECT COUNT(*) FROM "books" INNER JOIN "book_transactions" ON "books"."isbn" = "book_transactions"."book_id" WHERE "book_transactions"."member_id" = $1 AND "books"."isbn" = $2  [["member_id", 1], ["isbn", 123123]]
---
  <tbody>
    <% @member.books.uniq.each do |book| %>
      <% if @member.books.where(isbn: book.isbn).count.odd? %>